Function Reference

# Document Settings

| | | |
|---|---|---|
| DeleteAllDLComponents | DeleteDLComponent | DoubLines <sub>*obsolete in VectorWorks12.5*</sub> |
| DrwSize | GetCurrentPlanarRefID | GetDefaultTextSize |
| GetDLComponentClass | GetDLComponentFill | GetDLComponentFillColors |
| GetDLComponentName | GetDLComponentPenColors | GetDLComponentPenStyles <sub>*obsolete in Vectorworks 2019*</sub> |
| GetDLComponentPenWeights | GetDLComponentUseFillClassAttr | GetDLComponentUsePenClassAttr |
| GetDLComponentWidth | GetDLCompPenStylesN | GetDLControlOffset |
| GetDLOptions | GetDLSeparation | GetDrawingSizeRect |
| GetDrawingSizeRectN | GetFName | GetNumberOfDLComponents |
| GetOrigin | GetOriginInDocUnits | GetPref |
| GetPrefInt | GetPrefLongInt | GetPrefReal |
| GetPrefRGB | GetPrefString | GetWallPrefStyle |
| GridLines | InsertNewDLCompN | InsertNewDLComponent <sub>*obsolete in Vectorworks 2019*</sub> |
| PenGrid | RunGridSettingsDlg | SetConstrain |
| SetDimStd | SetDLComponentClass | SetDLComponentFill |
| SetDLComponentFillColors | SetDLComponentName | SetDLComponentPenColors |
| SetDLComponentPenStyles <sub>*obsolete in Vectorworks 2019*</sub> | SetDLComponentPenWeights | SetDLComponentUseFillClassAttr |
| SetDLComponentUsePenClassAttr | SetDLComponentWidth | SetDLCompPenStylesN |
| SetDLControlOffset | SetDLOptions | SetDLSeparation |
| SetOrigin | SetOriginAbsolute | SetPref |
| SetPrefInt | SetPrefLongInt | SetPrefReal |
| SetPrefRGB | SetPrefString | SetPrimaryDim |
| SetSecondaryDim | SetUnits | SetWallPrefStyle |